updated doco
